---
kind: type
id: T:Autodesk.Revit.DB.CurveArrArrayIterator
source: html/cdd6e636-1a16-2e4a-90db-ada0fcf0b074.htm
---
# Autodesk.Revit.DB.CurveArrArrayIterator

An iterator to a array.

## Syntax (C#)
```csharp
public abstract class CurveArrArrayIterator : APIObject,
	IEnumerator
```